# GetExternalFileReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetExternalFileReference Method
Element Class See Also
---
Gets information pertaining to the external file referenced by the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ExternalFileReference GetExternalFileReference()
```

Visual Basic
---
```text
Public Function GetExternalFileReference As ExternalFileReference
```

Visual C++
---
```text
public:
ExternalFileReference^ GetExternalFileReference()
```

# ### Return Value
An object containing path and type information for the external file referenced by the element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This Element does not represent an external file. |

# See Also
Element Class
Autodesk.Revit.DB Namespace